app/Controllers/Assets.php

SELECT *
FROM `assets`
---
    public function index()
    {
        if (!session('user_id')) {
            return redirect()->to(site_url('/'));
        }
        $assetModel = new AssetModel();
        $data['assets'] = $assetModel->findAll();