app/Controllers/Assets.php

SELECT *
FROM `assets`
WHERE `assets`.`id` = '2'
---
    public function delete($id)
    {
        if (!session('user_id')) {
            return redirect()->to('/');
        }

        $assetModel = new AssetModel();
        $asset = $assetModel->find($id);