app/Controllers/Assets.php

    public function index()
    {
        if (!session('user_id')) {
            return redirect()->to('/');
        }
        $assetModel = new AssetModel();
        $data['assets'] = $assetModel->findAll();
---
SELECT *
FROM `assets`
ORDER BY `id` DESC

    public function show($id)
    {
        if (!session('user_id')) {
            return redirect()->to('/');
        }
        $assetModel = new AssetModel();
        $data['asset'] = $assetModel->find($id);
---
SELECT *
FROM `assets`
WHERE `assets`.`id` = '2'