app/Controllers/Auth.php

    public function login()
    {
        $userModel = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $captcha = trim((string) $this->request->getPost('captcha'));
        $expectedCaptcha = session('captcha');

        if (
            $expectedCaptcha === null
            || !is_numeric($captcha)
            || (int) $captcha !== (int) $expectedCaptcha
        ) {
            return redirect()->back()->with('error', 'Captcha salah');
        }

        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = '@Adminaset2026'
 LIMIT 1