app/Controllers/Dashboard.php

    public function index()
    {
        if (!session('user_id')) {
            return redirect()->to(site_url('/'));
        }

        $assetModel = new AssetModel();

        return view('dashboard/index', [
            'title' => 'Dashboard',
            'total_barang' => $assetModel->countAll(),
            'barang_dipinjam' => $assetModel->where('status', 'dipinjam')->countAllResults(),
            'data_barang_tidak_ada' => 0,
            'barang_tersedia' => $assetModel->where('status', 'tersedia')->countAllResults(),
---
SELECT COUNT(*) AS `numrows` FROM `assets`
SELECT COUNT(*) AS `numrows`
FROM `assets`
WHERE `status` = 'dipinjam'
SELECT COUNT(*) AS `numrows`
FROM `assets`
WHERE `status` = 'ada'