app/Controllers/Peminjaman.php

SELECT `peminjaman`.*, `assets`.`nama_barang`
FROM `peminjaman`
JOIN `assets` ON `assets`.`id` = `peminjaman`.`barang_id`
ORDER BY `peminjaman`.`id` DESC
---
    public function history()
    {
        $history = $this->peminjamanModel
            ->select('peminjaman.*, assets.nama_barang')
            ->join('assets', 'assets.id = peminjaman.barang_id')
            ->orderBy('peminjaman.id', 'DESC')
            ->findAll();