app/Controllers/Users.php

    public function index()
    {
        if ($redirect = $this->ensureSession()) {
            return $redirect;
        }

        return view('users/index', [
            'title' => 'User Management',
            'users' => $this->userModel->orderBy('id', 'DESC')->findAll(),
---
SELECT *
FROM `users`
ORDER BY `id` DESC